[
    {
      "image": "https://images.pexels.com/photos/280222/pexels-photo-280222.jpeg?auto=compress&cs=tinysrgb&w=800",
      "estate_title": "Luxury Villa with Ocean View",
      "id": 1,
      "segment_name": "Premium",
      "description": "Perched atop a cliff overlooking the azure waters of the Pacific Ocean, this luxury villa offers an unparalleled living experience. With expansive floor-to-ceiling windows, every room is bathed in natural light, showcasing the elegant interior design and exquisite furnishings. The outdoor infinity pool seems to merge seamlessly with the horizon, providing a tranquil oasis for relaxation and entertainment. This architectural masterpiece also boasts a private theater, state-of-the-art gym, and a spa for ultimate indulgence. Experience coastal living at its finest in this breathtaking sanctuary.",
      "price": "$2,500,000",
      "Status": "sale",
      "Area": "5000 sq ft",
      "location": "Coastal Paradise, California",
      "facilities": ["Infinity Pool", "Home Theater", "Gym", "Spa"],
      "bedrooms": 5,
      "garages": 3,
      "bathrooms": 6
    },
    {
      "image": "https://images.pexels.com/photos/2089698/pexels-photo-2089698.jpeg?auto=compress&cs=tinysrgb&w=800",
      "estate_title": "Modern Loft in Downtown",
      "id": 2,
      "segment_name": "Urban",
      "description": "Situated in the vibrant heart of the city, this modern loft embodies urban luxury. With sleek lines and contemporary finishes, the open-concept living space offers versatility and style. Floor-to-ceiling windows frame panoramic views of the skyline, creating an inspiring backdrop for daily living. Step onto the private roof deck and enjoy alfresco dining while soaking in the bustling energy below. Within walking distance to renowned restaurants, galleries, and cultural attractions, this loft epitomizes cosmopolitan living at its finest.",
      "price": "$3,500/month",
      "Status": "rent",
      "Area": "1200 sq ft",
      "location": "Downtown Metropolis, New York",
      "facilities": ["Open Layout", "Exposed Brick Walls", "Roof Deck"],
      "bedrooms": 2,
      "garages": 1,
      "bathrooms": 2
    },
    {
      "image": "https://images.pexels.com/photos/164558/pexels-photo-164558.jpeg?auto=compress&cs=tinysrgb&w=800",
      "estate_title": "Classic Victorian Mansion",
      "id": 3,
      "segment_name": "Luxury",
      "description": "Step back in time and experience the grandeur of a bygone era in this classic Victorian mansion. Nestled within the historic district of London, this architectural gem exudes timeless elegance and sophistication. From the intricate woodwork to the ornate stained glass windows, every detail reflects the craftsmanship of a bygone era. The sprawling grounds offer serenity amidst the bustling city, with meticulously manicured gardens and charming pathways. With a ballroom, library, and formal dining room, this mansion is perfect for hosting lavish events and entertaining esteemed guests.",
      "price": "$5,750,000",
      "Status": "sale",
      "Area": "8000 sq ft",
      "location": "Historic District, London",
      "facilities": ["Formal Dining Room", "Ballroom", "Library", "Gardens"],
      "bedrooms": 8,
      "garages": 2,
      "bathrooms": 10
    },
    {
      "image": "https://images.pexels.com/photos/259588/pexels-photo-259588.jpeg?auto=compress&cs=tinysrgb&w=800",
      "estate_title": "Secluded Mountain Retreat",
      "id": 4,
      "segment_name": "Nature",
      "description": "Escape to tranquility in this secluded mountain retreat nestled amidst the rugged beauty of Colorado. Surrounded by towering pine trees and sweeping mountain vistas, this sanctuary offers a reprieve from the hustle and bustle of everyday life. Cozy up by the fireplace in the spacious living room or soak your cares away in the outdoor Jacuzzi while gazing at the starlit sky. With hiking trails right outside your door, adventure awaits at every turn. Whether you seek solitude or outdoor adventure, this mountain retreat offers the perfect blend of luxury and nature.",
      "price": "$1,200/week",
      "Status": "rent",
      "Area": "3000 sq ft",
      "location": "Serenity Valley, Colorado",
      "facilities": ["Fireplace", "Jacuzzi", "Deck with Mountain Views"],
      "bedrooms": 4,
      "garages": 2,
      "bathrooms": 3
    },
    {
      "image": "https://images.pexels.com/photos/206172/pexels-photo-206172.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "estate_title": "Elegant Townhouse in Historic District",
      "id": 5,
      "segment_name": "Heritage",
      "description": "Located in the heart of a charming historic district, this elegant townhouse offers a blend of classic architecture and modern comforts. Step through the ornate double doors into a light-filled foyer adorned with intricate moldings and a sweeping staircase. The spacious living areas feature high ceilings, hardwood floors, and period details, creating an ambiance of timeless sophistication. Relax in the lush courtyard garden or entertain guests in the formal dining room, perfect for hosting intimate gatherings. With its prime location and refined aesthetics, this townhouse is a true architectural gem.",
      "price": "$1,800,000",
      "Status": "sale",
      "Area": "2800 sq ft",
      "location": "Historic District, Charleston",
      "facilities": ["Courtyard Garden", "Formal Dining Room", "High Ceilings"],
      "bedrooms": 3,
      "garages": 1,
      "bathrooms": 4
    },
    {
      "image": "https://images.pexels.com/photos/209296/pexels-photo-209296.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "estate_title": "Cozy Cottage Retreat",
      "id": 6,
      "segment_name": "Rural",
      "description": "Escape to the countryside and unwind in this charming cottage retreat surrounded by picturesque landscapes. Tucked away amidst rolling hills and verdant meadows, this cozy abode offers a peaceful sanctuary for relaxation and rejuvenation. Step inside to discover a warm and inviting interior adorned with rustic furnishings and quaint decor. Curl up by the fireplace with a good book or enjoy al fresco dining on the sun-dappled patio overlooking the tranquil pond. Whether you're seeking a romantic getaway or a family retreat, this cottage promises a truly idyllic escape from the everyday hustle and bustle.",
      "price": "$350,000",
      "Status": "sale",
      "Area": "1500 sq ft",
      "location": "Countryside Haven, Vermont",
      "facilities": ["Fireplace", "Patio", "Tranquil Pond"],
      "bedrooms": 2,
      "garages": 0,
      "bathrooms": 2
    },
    {
      "image": "https://images.pexels.com/photos/221540/pexels-photo-221540.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "estate_title": "Riverside Retreat",
      "id": 7,
      "segment_name": "Scenic",
      "description": "Immerse yourself in nature's beauty at this stunning riverside retreat. Nestled along the tranquil banks of a winding river, this idyllic property offers a perfect blend of serenity and outdoor adventure. Enjoy fishing, kayaking, or simply relax on the expansive deck while taking in breathtaking views of the surrounding landscape. The charming cabin features a cozy interior with rustic furnishings and a wood-burning fireplace, creating a warm and inviting atmosphere. With spacious bedrooms, a fully-equipped kitchen, and modern amenities, this riverside retreat is an ideal getaway for nature lovers and outdoor enthusiasts.",
      "price": "$700,000",
      "Status": "sale",
      "Area": "2000 sq ft",
      "location": "Riverside Haven, Montana",
      "facilities": ["Riverfront Deck", "Wood-Burning Fireplace", "Fully-Equipped Kitchen"],
      "bedrooms": 3,
      "garages": 2,
      "bathrooms": 2
    },
    {
      "image": "https://images.pexels.com/photos/323775/pexels-photo-323775.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "estate_title": "Chic City Apartment",
      "id": 8,
      "segment_name": "City Living",
      "description": "Experience chic urban living in this stylish city apartment located in the heart of downtown. Boasting sleek modern design and panoramic city views, this sophisticated residence offers the ultimate in metropolitan luxury. The spacious open-concept floor plan is ideal for entertaining, with a gourmet kitchen, expansive living area, and designer finishes throughout. Relax and unwind in the luxurious master suite, complete with a spa-like en-suite bathroom and walk-in closet. With top-notch amenities and convenient access to dining, shopping, and entertainment, this city apartment is the epitome of cosmopolitan living.",
      "price": "$950,000",
      "Status": "sale",
      "Area": "1800 sq ft",
      "location": "Downtown Metropolis, California",
      "facilities": ["Gourmet Kitchen", "Master Suite", "Panoramic Views"],
      "bedrooms": 2,
      "garages": 1,
      "bathrooms": 3
    }
  ]
  